valioiv/esp32-http-wav-audio-streamer/main/app_httpd.c
    int64_t fr_end = esp_timer_get_time();
    ESP_LOGI(TAG, "FACE: %uB %ums %s%d", (uint32_t)(jchunk.len), (uint32_t)((fr_end - fr_start) / 1000), detected ? "DETECTED " : "", face_id);
    return res;
#endif
}

static esp_err_t stream_handler(httpd_req_t *req)
{
    camera_fb_t *fb = NULL;
    esp_err_t res = ESP_OK;
    size_t _jpg_buf_len = 0;
    uint8_t *_jpg_buf = NULL;
    char *part_buf[64];
#if CONFIG_ESP_FACE_DETECT_ENABLED
    dl_matrix3du_t *image_matrix = NULL;
    bool detected = false;
    int face_id = 0;
    int64_t fr_start = 0;
    int64_t fr_ready = 0;
    int64_t fr_face = 0;
    int64_t fr_recognize = 0;
    int64_t fr_encode = 0;
#endif

    static int64_t last_frame = 0;
    if (!last_frame)
    {
        last_frame = esp_timer_get_time();
    }

    res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
    if (res != ESP_OK)
    {
        return res;
    }

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

#ifdef CONFIG_LED_ILLUMINATOR_ENABLED
    enable_led(true);
    isStreaming = true;
#endif

    while (true)
    {
#if CONFIG_ESP_FACE_DETECT_ENABLED
        detected = false;
        face_id = 0;
#endif

        fb = esp_camera_fb_get();
        if (!fb)
        {
            ESP_LOGE(TAG, "Camera capture failed");
            res = ESP_FAIL;
        }
        else
        {
#if CONFIG_ESP_FACE_DETECT_ENABLED
            fr_start = esp_timer_get_time();
            fr_ready = fr_start;
            fr_face = fr_start;
            fr_encode = fr_start;
            fr_recognize = fr_start;
            if (!detection_enabled || fb->width > 400)
            {
#endif
                if (fb->format != PIXFORMAT_JPEG)
                {
                    bool jpeg_converted = frame2jpg(fb, 80, &_jpg_buf, &_jpg_buf_len);
                    esp_camera_fb_return(fb);
                    fb = NULL;
                    if (!jpeg_converted)
                    {
                        ESP_LOGE(TAG, "JPEG compression failed");
                        res = ESP_FAIL;
                    }
                }
                else
                {
                    _jpg_buf_len = fb->len;
                    _jpg_buf = fb->buf;
                }
#if CONFIG_ESP_FACE_DETECT_ENABLED
            }
            else
            {

                image_matrix = dl_matrix3du_alloc(1, fb->width, fb->height, 3);

                if (!image_matrix)
                {
                    ESP_LOGE(TAG, "dl_matrix3du_alloc failed");
                    res = ESP_FAIL;
                }
                else
                {
                    if (!fmt2rgb888(fb->buf, fb->len, fb->format, image_matrix->item))
                    {
                        ESP_LOGE(TAG, "fmt2rgb888 failed");
                        res = ESP_FAIL;
                    }
                    else
                    {
#if CONFIG_ESP_FACE_DETECT_LSSH
                        lssh_update_image_shape(&lssh_config, image_matrix->h, image_matrix->w);
#endif
                        fr_ready = esp_timer_get_time();
                        box_array_t *net_boxes = NULL;
                        if (detection_enabled)
                        {
#if CONFIG_ESP_FACE_DETECT_MTMN
                            net_boxes = face_detect(image_matrix, &mtmn_config);
#endif

#if CONFIG_ESP_FACE_DETECT_LSSH
                            net_boxes = lssh_detect_object(image_matrix, lssh_config);
#endif
                        }
                        fr_face = esp_timer_get_time();
                        fr_recognize = fr_face;
                        if (net_boxes || fb->format != PIXFORMAT_JPEG)
                        {
                            if (net_boxes)
                            {
                                detected = true;
#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
                                if (recognition_enabled)
                                {
                                    face_id = run_face_recognition(image_matrix, net_boxes);
                                }
                                fr_recognize = esp_timer_get_time();
#endif
                                draw_face_boxes(image_matrix, net_boxes, face_id);
                                dl_lib_free(net_boxes->score);
                                dl_lib_free(net_boxes->box);
                                if (net_boxes->landmark != NULL)
                                    dl_lib_free(net_boxes->landmark);
                                dl_lib_free(net_boxes);
                            }
                            if (!fmt2jpg(image_matrix->item, fb->width * fb->height * 3, fb->width, fb->height, PIXFORMAT_RGB888, 90, &_jpg_buf, &_jpg_buf_len))
                            {
                                ESP_LOGE(TAG, "fmt2jpg failed");
                            }
                            esp_camera_fb_return(fb);
                            fb = NULL;
                        }
                        else
                        {
                            _jpg_buf = fb->buf;
                            _jpg_buf_len = fb->len;
                        }
                        fr_encode = esp_timer_get_time();
                    }
                    dl_matrix3du_free(image_matrix);
                }
            }
#endif
        }
        if (res == ESP_OK)
        {
            size_t hlen = snprintf((char *)part_buf, 64, _STREAM_PART, _jpg_buf_len);
            res = httpd_resp_send_chunk(req, (const char *)part_buf, hlen);
        }
        if (res == ESP_OK)
        {
            res = httpd_resp_send_chunk(req, (const char *)_jpg_buf, _jpg_buf_len);
        }
        if (res == ESP_OK)
        {
            res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));
        }
        if (fb)
        {
            esp_camera_fb_return(fb);
            fb = NULL;
            _jpg_buf = NULL;
        }
        else if (_jpg_buf)
        {
            free(_jpg_buf);
            _jpg_buf = NULL;
        }
        if (res != ESP_OK)
        {
            break;
        }
        int64_t fr_end = esp_timer_get_time();

#if CONFIG_ESP_FACE_DETECT_ENABLED
        int64_t ready_time = (fr_ready - fr_start) / 1000;
        int64_t face_time = (fr_face - fr_ready) / 1000;
        int64_t recognize_time = (fr_recognize - fr_face) / 1000;
        int64_t encode_time = (fr_encode - fr_recognize) / 1000;
        int64_t process_time = (fr_encode - fr_start) / 1000;
#endif

        int64_t frame_time = fr_end - last_frame;
        last_frame = fr_end;
        frame_time /= 1000;
        uint32_t avg_frame_time = ra_filter_run(&ra_filter, frame_time);
        ESP_LOGI(TAG, "MJPG: %uB %ums (%.1ffps), AVG: %ums (%.1ffps)"
#if CONFIG_ESP_FACE_DETECT_ENABLED
                      ", %u+%u+%u+%u=%u %s%d"
#endif
                 ,
                 (uint32_t)(_jpg_buf_len),
                 (uint32_t)frame_time, 1000.0 / (uint32_t)frame_time,
                 avg_frame_time, 1000.0 / avg_frame_time
#if CONFIG_ESP_FACE_DETECT_ENABLED
                 ,
                 (uint32_t)ready_time, (uint32_t)face_time, (uint32_t)recognize_time, (uint32_t)encode_time, (uint32_t)process_time,
                 (detected) ? "DETECTED " : "", face_id
#endif
        );
    }

#ifdef CONFIG_LED_ILLUMINATOR_ENABLED
    isStreaming = false;
    enable_led(false);
#endif

    last_frame = 0;
    return res;
}

static char wav_header[44] = {
    0x52, // 'R'
    0x49, // 'I'
    0x46, // 'F'
    0x46, // 'F'
    0x24, // size
    0x0,  // size
    0x9,  // size
    0x3d, // size
    0x57, // 'W'
    0x41, // 'A'
    0x56, // 'V'
    0x45, // 'E'
    0x66, // 'f'
    0x6d, // 'm'
    0x74, // 't'
    0x20, // ' '
    0x10, // Length of above format data
    0x0,  // Length of above format data
    0x0,  // Length of above format data
    0x0,  // Length of above format data
    0x1,  // Format type (1 - PCM)
    0x0,  // Format type (1 - PCM)
    0x1,  // Channels
    0x0,  // Channels
    0x80, //0x44, // sampleRate
    0x3e, //0xac, // sampleRate
    0x0,  //0x0,  // sampleRate
    0x0,  //0x0,  // sampleRate
    0x00, //0x88, // (sampleRate * channels * bitsPerSample // 8)
    0x7d, //0x58, // (sampleRate * channels * bitsPerSample // 8)
    0x00, //0x1,  // (sampleRate * channels * bitsPerSample // 8)
    0x00, //0x0,  // (sampleRate * channels * bitsPerSample // 8)
    0x2,  // (channels * bitsPerSample // 8)
    0x0,  // (channels * bitsPerSample // 8)
    0x10, // bitsPerSample
    0x0,  // bitsPerSample
    0x64, // 'd'
    0x61, // 'a'
    0x74, // 't'
    0x61, // 'a'
    0x0,  // datasize
    0x0,  // datasize
    0x9,  // datasize
    0x3d, // datasize
};

static esp_err_t audio_handler(httpd_req_t *req)
{
    esp_err_t res = ESP_OK;
    void* audio_chunk = NULL;
    size_t wav_header_len;
    size_t audio_chunk_len;

TRY_AGAIN:
    res = httpd_resp_set_type(req, _AUDIO_CONTENT_TYPE);
    if (res != ESP_OK)
    {
        return httpd_resp_send_500(req);
    }
    
    wav_header_len = sizeof(wav_header) / sizeof(char);
    ESP_LOGE(TAG, ">>>>>>>>> %d >>> %c %c %c %c", wav_header_len, wav_header[0], wav_header[1], wav_header[2], wav_header[3]);
    res = httpd_resp_send_chunk(req, (const char *)wav_header, wav_header_len);
    if (res != ESP_OK)
    {
        ESP_LOGE(TAG, "WAV header sent failed");
        return httpd_resp_send_500(req);
    }

    while(true)
    {
        audio_chunk = app_audio_get_input();
        if (!audio_chunk)
        {
            ESP_LOGE(TAG, "Audio capture failed");
            return httpd_resp_send_500(req);
        }

